public/blog/pinebook-pro/pinebook-pro-write-to-spi-flash/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Pinebook Pro Write to Spit Flash</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Pinebook Pro Write to Spit Flash</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Pinebook Pro Write to Spit Flash</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Flashing the SPI</a>
<ul>
<li><a href="#headline-4">Note</a>
</li>
<li><a href="#headline-5">Downloading files</a>
</li>
<li><a href="#headline-6">Flashing the SPI</a>
</li>
<li><a href="#headline-7">Important details</a>
</li>
<li><a href="#headline-8">Boot order</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Pinebook Pro Write to Spit Flash
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Directions for flashing a custom bootloader to internal Pinebook Pro&#39;s SPI Flash
chip. This makes it it unnecessary to have boot code on the emmc or microsd,
enabling full NVME boot. NVME boot extremely is hit or miss.</p>
<p>
Be prepared to recover your broken SPI flash if an error occurs.
When a binary is written to the SPI flash, the SPI flash will be what chooses which drives to boot from.
Any problems when writing to the SPI can render your machine soft bricked.
Learn about the SPI flash and recovery options here:</p>
<ol>
<li><a href="https://wiki.pine64.org/index.php/Pinebook_Pro_SPI">https://wiki.pine64.org/index.php/Pinebook_Pro_SPI</a></li>
<li><a href="https://wiki.pine64.org/index.php/Pinebook_Pro#Using_the_SPI_flash_device">https://wiki.pine64.org/index.php/Pinebook_Pro#Using_the_SPI_flash_device</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Flashing the SPI
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Note
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
This guide is a simpler rewrite of <a href="https://forum.pine64.org/showthread.php?tid=8439">pcm72&#39;s</a> forum post. I&#39;d recommend reading that whole thread before proceeding.
We&#39;re going to be flashing the Pinebook Pro&#39;s SPI flash so that it contains boot code for the nvme.
Your kernel needs to be compiled with SPI support. A simple check will be to see if /dev/mtd0 exists.
I&#39;m using Manjaro Arm.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Downloading files
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Download the files from <a href="https://github.com/pcm720/rockchip-u-boot/releases">pcm72&#39;s git release page.</a></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Flashing the SPI
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>This is all you have to do:</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>dd <span style="color:#66d9ef">if</span><span style="color:#f92672">=</span>spiflash.bin of<span style="color:#f92672">=</span>/dev/mtd0 status<span style="color:#f92672">=</span>progress</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Important details
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>In pc72&#39;s post, he explained why booting from micro-sd will fail.
You basically have to remove all boot code from your micro-sd to have the SPI boot from it.</p>
<p>
Here&#39;s how you do that:</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>dd <span style="color:#66d9ef">if</span><span style="color:#f92672">=</span>/dev/zero bs<span style="color:#f92672">=</span>32k seek<span style="color:#f92672">=</span><span style="color:#ae81ff">1</span> count<span style="color:#f92672">=</span><span style="color:#ae81ff">1</span> of<span style="color:#f92672">=</span>&lt;microSD&gt;
</span></span><span style="display:flex;"><span>dd <span style="color:#66d9ef">if</span><span style="color:#f92672">=</span>/dev/zero bs<span style="color:#f92672">=</span>64k seek<span style="color:#f92672">=</span><span style="color:#ae81ff">128</span> count<span style="color:#f92672">=</span><span style="color:#ae81ff">64</span> of<span style="color:#f92672">=</span>&lt;microSD&gt;
</span></span><span style="display:flex;"><span>dd <span style="color:#66d9ef">if</span><span style="color:#f92672">=</span>/dev/zero bs<span style="color:#f92672">=</span>64k seek<span style="color:#f92672">=</span><span style="color:#ae81ff">192</span> count<span style="color:#f92672">=</span><span style="color:#ae81ff">64</span> of<span style="color:#f92672">=</span>&lt;microSD&gt;</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Boot order
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<ol>
<li>micro-sd</li>
<li>nvme</li>
<li>emmc</li>
</ol>
<p>I&#39;m not sure if it&#39;s capable of USB boot.</p>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
